# Terraform - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/shared/terraform/workspaces/production relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/production/runs/run-aY4CVAiXBKv9GZSh

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
module.common_resources.data.tfe_organization.default: Refreshing...
module.common_resources.data.tfe_organization.default: Refresh complete after 0s [id=org-5y3MEgeuSg9nz1bX]
module.common_resources.tfe_project.default: Refreshing state... [id=prj-BQ7b6Ao7aHMX5WNH]
module.common_resources.data.tfe_workspace.default: Refreshing...
module.common_resources.module.customer.tfe_workspace.customer_api: Refreshing state... [id=ws-KEfK65Wc1qu5WAUt]
module.common_resources.module.customer.tfe_workspace.customer: Refreshing state... [id=ws-PBEvjP3Ur3x6UjJi]
module.common_resources.module.organization.tfe_workspace.organization_api: Refreshing state... [id=ws-VQZv9TkMF3wQWGbP]
module.common_resources.module.identity.tfe_workspace.identity_api: Refreshing state... [id=ws-ThMoRnVZQwcipbsd]
module.common_resources.module.identity.tfe_workspace.identity: Refreshing state... [id=ws-jq4gKqPRUQaeMAk1]
module.common_resources.module.organization.tfe_workspace.organization: Refreshing state... [id=ws-adsVxF16bC4U9fEt]
module.common_resources.module.shared.tfe_workspace.shared: Refreshing state... [id=ws-iiNY4egjXv1pkJ6p]
module.common_resources.module.customer.tfe_variable.customer_aws_access_key_id: Refreshing state... [id=var-MGucWXE3rMmEyMxT]
module.common_resources.module.customer.tfe_variable.customer_cockroach_api_key: Refreshing state... [id=var-gZQjSPpydsUzye9V]
module.common_resources.module.customer.tfe_variable.customer_aws_secret_access_key: Refreshing state... [id=var-X6aC51VsD9y2FRnm]
module.common_resources.module.customer.tfe_variable.customer_upstash_api_key: Refreshing state... [id=var-toyWEDUBSFDci8Td]
module.common_resources.module.organization.tfe_variable.organization_api_aws_secret_access_key: Refreshing state... [id=var-b2gL49Rry8gJXysE]
module.common_resources.data.tfe_workspace.default: Refresh complete after 1s [id=ws-j7aUcZgWr6pBSs5A]
module.common_resources.module.organization.tfe_variable.organization_api_aws_access_key_id: Refreshing state... [id=var-aZo4LLt6fZfc1f9d]
module.common_resources.module.organization.tfe_variable.organization_api_upstash_api_key: Refreshing state... [id=var-AUmxBYTf5sFtYamH]
module.common_resources.module.organization.tfe_variable.organization_api_cockroach_api_key: Refreshing state... [id=var-9gsVWi5Q1vCJ5gFg]
module.common_resources.module.organization.tfe_variable.organization_aws_access_key_id: Refreshing state... [id=var-et7j7QD88f9xfo2g]
module.common_resources.module.organization.tfe_variable.organization_aws_secret_access_key: Refreshing state... [id=var-DDAtfzjHu6hBsHYs]
module.common_resources.module.organization.tfe_variable.organization_upstash_api_key: Refreshing state... [id=var-Svh7qnxPVjiLcrL8]
module.common_resources.module.organization.tfe_variable.organization_cockroach_api_key: Refreshing state... [id=var-2pUmgnGCmzJu1RtK]
module.common_resources.data.tfe_variables.default: Refreshing...
module.common_resources.module.shared.tfe_variable.shared_upstash_api_key: Refreshing state... [id=var-XtMa8ucVBXuTgifC]
module.common_resources.module.shared.tfe_variable.shared_aws_access_key_id: Refreshing state... [id=var-ARHPgiMihBywhis2]
module.common_resources.module.shared.tfe_variable.shared_aws_secret_access_key: Refreshing state... [id=var-AaHG7DjmDmpppgSF]
module.common_resources.module.shared.tfe_variable.shared_cockroach_api_key: Refreshing state... [id=var-x8m3FUH9HBQ9gVST]
module.common_resources.module.identity.tfe_variable.identity_api_upstash_api_key: Refreshing state... [id=var-kJZDe7GkPbMRqGF7]
module.common_resources.module.identity.tfe_variable.identity_api_cockroach_api_key: Refreshing state... [id=var-qD7ZzD9frEs39Gxw]
module.common_resources.module.identity.tfe_variable.identity_api_aws_secret_access_key: Refreshing state... [id=var-PUnpJPysfgbiXZkG]
module.common_resources.module.identity.tfe_variable.identity_api_aws_access_key_id: Refreshing state... [id=var-HmX4CSt4CFBYmLZF]
module.common_resources.module.customer.tfe_variable.customer_api_aws_secret_access_key: Refreshing state... [id=var-cTaGS8pkF9yUcP4h]
module.common_resources.data.tfe_variables.default: Refresh complete after 0s [id=variables/ws-j7aUcZgWr6pBSs5A]
module.common_resources.module.customer.tfe_variable.customer_api_aws_access_key_id: Refreshing state... [id=var-pUChvcxNcGgYvi7f]
module.common_resources.module.customer.tfe_variable.customer_api_cockroach_api_key: Refreshing state... [id=var-RMujyW3oBRptJNvb]
module.common_resources.module.customer.tfe_variable.customer_api_upstash_api_key: Refreshing state... [id=var-8P4cZ1nbrVnJDpUJ]
module.common_resources.module.identity.tfe_variable.identity_aws_secret_access_key: Refreshing state... [id=var-AyqTM9CxSPi6NkFg]
module.common_resources.module.identity.tfe_variable.identity_aws_access_key_id: Refreshing state... [id=var-3Apu1YHn7PcTjQxi]
module.common_resources.module.identity.tfe_variable.identity_upstash_api_key: Refreshing state... [id=var-SAPRgfRsJU1jT32C]
module.common_resources.module.identity.tfe_variable.identity_cockroach_api_key: Refreshing state... [id=var-mn9mTWdTvHciz1ZK]
module.common_resources.module.customer.tfe_workspace.customer: Drift detected (update)
module.common_resources.module.customer.tfe_workspace.customer_api: Drift detected (update)
module.common_resources.module.identity.tfe_workspace.identity: Drift detected (update)
module.common_resources.module.identity.tfe_workspace.identity_api: Drift detected (update)
module.common_resources.module.organization.tfe_workspace.organization_api: Drift detected (update)
module.common_resources.module.organization.tfe_workspace.organization: Drift detected (update)
module.common_resources.module.shared.tfe_workspace.shared: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.common_resources.module.gateway.tfe_variable.gateway_api_aws_access_key_id will be created
  + resource "tfe_variable" "gateway_api_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.gateway.tfe_variable.gateway_api_aws_secret_access_key will be created
  + resource "tfe_variable" "gateway_api_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.gateway.tfe_workspace.gateway_api will be created
  + resource "tfe_workspace" "gateway_api" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "local"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "production_gateway_api"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = "prj-BQ7b6Ao7aHMX5WNH"
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "api",
          + "gateway",
          + "production",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/gateway/infrastructure/workspaces/production"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*